In [9]:
import pandas as pd

In [10]:
df = pd.read_excel('Cola.xlsx')

In [11]:
print(df.head())
print(df.isnull().sum())
print(df.info)

   Data provided by SimFin              Unnamed: 1 Unnamed: 2 Unnamed: 3  \
0                      NaN                     NaN        NaN        NaN
1  Profit & Loss statement                     NaN        NaN        NaN
2                      NaN          in million USD     FY '09     FY '10
3                      NaN  NET OPERATING REVENUES      30990      35119
4                      NaN      Cost of goods sold      11088      12693

  Unnamed: 4 Unnamed: 5 Unnamed: 6 Unnamed: 7 Unnamed: 8 Unnamed: 9  \
0        NaN        NaN        NaN        NaN        NaN        NaN
1        NaN        NaN        NaN        NaN        NaN        NaN
2     FY '11     FY '12     FY '13     FY '14     FY '15     FY '16
3      46542      48017      46854      45998      44294      41863
4      18215      19053      18421      17889      17482      16465

  Unnamed: 10 Unnamed: 11
0         NaN         NaN
1         NaN         NaN
2      FY '17      FY '18
3       35410       31856
4       13255       11770
Data provided by SimFin    100
Unnamed: 1                   6
Unnamed: 2                  21
Unnamed: 3                  21
Unnamed: 4                  21
Unnamed: 5                  21
Unnamed: 6                  21
Unnamed: 7                  21
Unnamed: 8                  13
Unnamed: 9                  11
Unnamed: 10                 10
Unnamed: 11                 10
dtype: int64
<bound method DataFrame.info of      Data provided by SimFin  \
0                        NaN
1    Profit & Loss statement
2                        NaN
3                        NaN
4                        NaN
..                       ...
98                       NaN
99                       NaN
100                      NaN
101                      NaN
102                      NaN

                                            Unnamed: 1 Unnamed: 2 Unnamed: 3  \
0                                                  NaN        NaN        NaN
1                                                  NaN        NaN        NaN
2                                       in million USD     FY '09     FY '10
3                               NET OPERATING REVENUES      30990      35119
4                                   Cost of goods sold      11088      12693
..                                                 ...        ...        ...
98   Effect of exchange rate changes on cash and ca...        576       -166
99   Cash Provided by (Used in) Investing Activitie...        NaN        NaN
100  Cash Provided by (Used in) Financing Activitie...        NaN        NaN
101  Net Cash Provided by (Used in) Discontinued Op...        NaN        NaN
102            Net increase (decrease) during the year       2320       1496

    Unnamed: 4 Unnamed: 5 Unnamed: 6 Unnamed: 7 Unnamed: 8 Unnamed: 9  \
0          NaN        NaN        NaN        NaN        NaN        NaN
1          NaN        NaN        NaN        NaN        NaN        NaN
2       FY '11     FY '12     FY '13     FY '14     FY '15     FY '16
3        46542      48017      46854      45998      44294      41863
4        18215      19053      18421      17889      17482      16465
..         ...        ...        ...        ...        ...        ...
98        -430       -255       -611       -934       -878         -6
99         NaN        NaN        NaN        NaN          0          0
100        NaN        NaN        NaN        NaN          0          0
101        NaN        NaN        NaN        NaN          0          0
102       4286      -4361       1972      -1456      -1649       1246

    Unnamed: 10 Unnamed: 11
0           NaN         NaN
1           NaN         NaN
2        FY '17      FY '18
3         35410       31856
4         13255       11770
..          ...         ...
98          241        -262
99          -58        -421
100         -38         205
101          15          91
102       -2477        2945

[103 rows x 12 columns]>

In [12]:
df = df.drop(columns=df.columns[0])

df.columns = ['Item', "FY '09", "FY '10", "FY '11", "FY '12", "FY '13", "FY '14", "FY '15", "FY '16", "FY '17", "FY '18"]

df = df.dropna(how='all')

df = df.dropna(subset=['Item'])

df = df.reset_index(drop=True)

In [13]:
print(df.head())
print(df.info())

                                           Item  FY '09  FY '10  FY '11  \
0                                in million USD  FY '09  FY '10  FY '11
1                        NET OPERATING REVENUES   30990   35119   46542
2                            Cost of goods sold   11088   12693   18215
3                                  Gross Profit   19902   22426   28327
4  Selling, general and administrative expenses   11358   13194   17422

   FY '12  FY '13  FY '14  FY '15  FY '16  FY '17  FY '18
0  FY '12  FY '13  FY '14  FY '15  FY '16  FY '17  FY '18
1   48017   46854   45998   44294   41863   35410   31856
2   19053   18421   17889   17482   16465   13255   11770
3   28964   28433   28109   26812   25398   22155   20086
4   17738   17310   17218   16427   15262   12654   10307
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Item    97 non-null     object
 1   FY '09  82 non-null     object
 2   FY '10  82 non-null     object
 3   FY '11  82 non-null     object
 4   FY '12  82 non-null     object
 5   FY '13  82 non-null     object
 6   FY '14  82 non-null     object
 7   FY '15  90 non-null     object
 8   FY '16  92 non-null     object
 9   FY '17  93 non-null     object
 10  FY '18  93 non-null     object
dtypes: object(11)
memory usage: 8.5+ KB
None

In [14]:
df.to_excel("dataset_bersih.xlsx", index=False)

In [16]:
df = pd.read_csv("dirty_cafe_sales.csv")

In [17]:
print(df.head())
print(df.isnull().sum())
print(df.info())

  Transaction ID    Item Quantity Price Per Unit Total Spent  Payment Method  \
0    TXN_1961373  Coffee        2            2.0         4.0     Credit Card
1    TXN_4977031    Cake        4            3.0        12.0            Cash
2    TXN_4271903  Cookie        4            1.0       ERROR     Credit Card
3    TXN_7034554   Salad        2            5.0        10.0         UNKNOWN
4    TXN_3160411  Coffee        2            2.0         4.0  Digital Wallet

   Location Transaction Date
0  Takeaway       2023-09-08
1  In-store       2023-05-16
2  In-store       2023-07-19
3   UNKNOWN       2023-04-27
4  In-store       2023-06-11
Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB
None

In [18]:
for col in ['Quantity', 'Price Per Unit', 'Total Spent']:
    df[col] = pd.to_numeric(df[col], errors='coerce')

In [19]:
df['Payment Method'] = df['Payment Method'].replace('UNKNOWN', pd.NA)
df['Location'] = df['Location'].replace('UNKNOWN', pd.NA)

In [20]:
df['Transaction Date'] = pd.to_datetime(df['Transaction Date'], errors='coerce')

In [21]:
df = df.dropna(subset=['Item', 'Transaction Date'])

In [22]:
df['Payment Method'] = df['Payment Method'].fillna('Unknown')

In [23]:
for col in ['Quantity', 'Price Per Unit', 'Total Spent']:
    median_value = df[col].median()
    df[col] = df[col].fillna(median_value)

In [24]:
df = df.reset_index(drop=True)

In [25]:
print(df.info())
print(df.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9225 entries, 0 to 9224
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9225 non-null   object
 1   Item              9225 non-null   object
 2   Quantity          9225 non-null   float64
 3   Price Per Unit    9225 non-null   float64
 4   Total Spent       9225 non-null   float64
 5   Payment Method    9225 non-null   object
 6   Location          5890 non-null   object
 7   Transaction Date  9225 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 576.7+ KB
None
  Transaction ID    Item  Quantity  Price Per Unit  Total Spent  \
0    TXN_1961373  Coffee       2.0             2.0          4.0
1    TXN_4977031    Cake       4.0             3.0         12.0
2    TXN_4271903  Cookie       4.0             1.0          8.0
3    TXN_7034554   Salad       2.0             5.0         10.0
4    TXN_3160411  Coffee       2.0             2.0          4.0

   Payment Method  Location Transaction Date
0     Credit Card  Takeaway       2023-09-08
1            Cash  In-store       2023-05-16
2     Credit Card  In-store       2023-07-19
3         Unknown      <NA>       2023-04-27
4  Digital Wallet  In-store       2023-06-11

In [26]:
df.to_csv("clean_cafe_sales.csv", index=False)